mat1 <- matrix(c(1, 2, 3, 4))
mat1
#     [,1]
#[1,]    1
#[2,]    2
#[3,]    3
#[4,]    4


mat2 <- matrix(c(1, 2, 3, 4), nrow = 2)
mat2
#     [,1] [,2]
#[1,]    1    3
#[2,]    2    4


mat3 <- matrix(c(1, 2, 3, 4), nrow = 2, byrow = T)
mat3
#     [,1] [,2]
#[1,]    1    2
#[2,]    3    4

mat3
#     [,1] [,2]
#[1,]    1    2
#[2,]    3    4
mat3[,1]
#[1] 1 3
mat3[1,]
#[1] 1 2
mat3[1,1]
#[1] 1


#문제
#아래와 같은 매트릭스를 만드는 코드를 작성하세요.
#mat4
##     [,1] [,2] [,3]
##[1,]    1    2    3
##[2,]    4    5    6
##[3,]    7    8    9
mat4 <- matrix(c(1, 2, 3, 4, 5, 6, 7, 8, 9), nrow = 3, byrow = T)
mat4
#     [,1] [,2] [,3]
#[1,]    1    2    3
#[2,]    4    5    6
#[3,]    7    8    9

#행 추가(rbind)
mat4 <- rbind(mat4, c(11, 12, 13))
mat4
#     [,1] [,2] [,3]
#[1,]    1    2    3
#[2,]    4    5    6
#[3,]    7    8    9
#[4,]   11   12   13

mat5 <- matrix(c('a', 'b', 'c', 'd'), nrow = 2, byrow = T)
mat5
#     [,1] [,2]
#[1,] "a"  "b" 
#[2,] "c"  "d"

#열추가(cbind)
mat5 <- cbind(mat5, c('e', 'f'))
mat5
#     [,1] [,2] [,3]
#[1,] "a"  "b"  "e" 
#[2,] "c"  "d"  "f"

colnames(mat5) <- c('Frst', 'Second', 'Third')
mat5
#[1,] "a"  "b"    "e"  
#[2,] "c"  "d"    "f"


#문제
#아래 그림과 같은 형태의 행렬을 만드세요.
seasons <- matrix(c('봄', '가을', '여름', '겨울'), nrow=2, byrow=T)
seasons
#     [,1]   [,2]  
#[1,] "봄"   "가을"
#[2,] "여름" "겨울"
seasons <- matrix(c('봄', '가을', '여름', '겨울'), nrow=2)
seasons
#     [,1]   [,2]  
#[1,] "봄"   "여름"
#[2,] "가을" "겨울"

#아래 그림같이 season행렬에서 여름과 겨울만 조회하는 방법을 쓰세요.
#seasons <- matrix(c('봄', '가을', '여름', '겨울'), nrow=2)
#seasons
##     [,1]   [,2]  
##[1,] "봄"   "여름"
##[2,] "가을" "겨울"
#
#[1] "여름" "겨울"
seasons[3:4]
#[1] "여름" "겨울"

#아래 그림같이 seasons행렬에 3번행을 추가하여 seasons_2행렬을 만드세요.
#seasons
##     [,1]   [,2]  
##[1,] "봄"   "여름"
##[2,] "가을" "겨울"
#
#seasons
##     [,1]   [,2]  
##[1,] "봄"   "여름"
##[2,] "가을" "겨울"
##[3,] "초봄" "초가을"
seasons_2 <- rbind(seasons, c('초봄', '초가을'))
seasons_2
#     [,1]   [,2]    
#[1,] "봄"   "여름"  
#[2,] "가을" "겨울"  
#[3,] "초봄" "초가을"

#아래 그림같이 seasons_2행렬에 3번행을 추가하여 seasons_3행렬을 만드세요.
#seasons_2
##     [,1]   [,2]    
##[1,] "봄"   "여름"  
##[2,] "가을" "겨울"  
##[3,] "초봄" "초가을"
#
#seasns_3
##     [,1]   [,2]     [,3]    
##[1,] "봄"   "여름"   "초여름"
##[2,] "가을" "겨울"   "초겨울"
##[3,] "초봄" "초가을" "한겨울"
seasons_3 <- cbind(seasons_2, c('초여름', '초겨울', '한겨울'))
seasons_3
#     [,1]   [,2]     [,3]    
#[1,] "봄"   "여름"   "초여름"
#[2,] "가을" "겨울"   "초겨울"
#[3,] "초봄" "초가을" "한겨울"
